In [8]:
my_dictionary={"name": "person 1", "age": 35, "Salary": 400}

In [9]:
print(my_dictionary)

{'name': 'person 1', 'age': 35, 'Salary': 400}

In [27]:
my_dictionary={ "name":["person 1", "person 2", "person 3", "person 4","person 5"],
     "age":[45,30,60,40,38],
"salary":[300,400,700,500,600]}

In [38]:
my_dictionary["Location"]:["Mombasa", "Nairobi", "Kisumu", "Narok","Webuye"]

In [37]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [45, 30, 60, 40, 38],
 'salary': [300, 400, 700, 500, 600]}

In [45]:
my_dictionary["Location"]=["Mombasa", "Nairobi", "Kisumu", "Narok","Webuye"]

In [43]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [45, 30, 60, 40, 38],
 'salary': [300, 400, 700, 500, 600]}

In [44]:
for key, value in my_dictionary.items():
    print(key, value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [45, 30, 60, 40, 38]
salary [300, 400, 700, 500, 600]

In [48]:
import pandas as pd

In [49]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [45, 30, 60, 40, 38],
 'salary': [300, 400, 700, 500, 600],
 'Location': ['Mombasa', 'Nairobi', 'Kisumu', 'Narok', 'Webuye']}

In [52]:
df = pd.DataFrame(my_dictionary)

In [53]:
df

       name  age  salary Location
0  person 1   45     300  Mombasa
1  person 2   30     400  Nairobi
2  person 3   60     700   Kisumu
3  person 4   40     500    Narok
4  person 5   38     600   Webuye

In [54]:
df["name"]

0    person 1
1    person 2
2    person 3
3    person 4
4    person 5
Name: name, dtype: object

In [58]:
df[["name","Location"]]

       name Location
0  person 1  Mombasa
1  person 2  Nairobi
2  person 3   Kisumu
3  person 4    Narok
4  person 5   Webuye

In [61]:
df["age"]+1

0    46
1    31
2    61
3    41
4    39
Name: age, dtype: int64

In [62]:
df.dtypes

name        object
age          int64
salary       int64
Location    object
dtype: object

In [70]:
df["age"]=df["age"]+1

In [73]:
df

       name  age  salary Location
0  person 1   48    1300  Mombasa
1  person 2   33    1400  Nairobi
2  person 3   63    1700   Kisumu
3  person 4   43    1500    Narok
4  person 5   41    1600   Webuye

In [72]:
df["age"],df["salary"]=df["age"]+1,df["salary"]+500

In [69]:
df

       name  age  salary Location
0  person 1   46     800  Mombasa
1  person 2   31     900  Nairobi
2  person 3   61    1200   Kisumu
3  person 4   41    1000    Narok
4  person 5   39    1100   Webuye